emacs/taemax/config.org
#+STARTUP: indent
* Adding Package Archives
#+BEGIN_SRC emacs-lisp
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.org/packages/")
                         ("org" . "http://orgmode.org/elpa/")))
#+END_SRC

#+RESULTS:
: ((gnu . http://elpa.gnu.org/packages/) (melpa . http://melpa.org/packages/) (org . http://orgmode.org/elpa/))

* Custom file
#+BEGIN_SRC emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
  (load custom-file)
#+END_SRC

#+RESULTS:
: t

* =USE-PACKPAGE=

#+BEGIN_SRC emacs-lisp
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(use-package delight :ensure t)
(use-package use-package-ensure-system-package :ensure t)
#+END_SRC

#+RESULTS:

* =DOOM-MODELINE=
#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode))
#+END_SRC

* =NORD-THEME=
#+BEGIN_SRC emacs-lisp
(use-package nord-theme
  :ensure t)
(setq nord-comment-brightness 15)
(load-theme 'nord t)
#+END_SRC

#+RESULTS:
: t
** Nord-Theme org-block and org-checkbox
Original values are
#+BEGIN_EXAMPLE
(custom-theme-set-faces 'user
                        `(org-block ((,class (:foreground ,nord4))))
                        `(org-block-background ((,class (:background ,nord0))))
                        `(org-block-begin-line ((,class (:foreground ,nord7))))
                        `(org-block-end-line ((,class (:foreground ,nord7)))))
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
;;;; Color Constants
(let ((class '((class color) (min-colors 89)))
      (nord0 (if (display-graphic-p) "#2E3440" nil))
      (nord1 (if (display-graphic-p) "#3B4252" "black"))
      (nord2 (if (display-graphic-p) "#434C5E" "#434C5E"))
      (nord3 (if (display-graphic-p) "#4C566A" "brightblack"))
      (nord4 (if (display-graphic-p) "#D8DEE9" "#D8DEE9"))
      (nord5 (if (display-graphic-p) "#E5E9F0" "white"))
      (nord6 (if (display-graphic-p) "#ECEFF4" "brightwhite"))
      (nord7 (if (display-graphic-p) "#8FBCBB" "cyan"))
      (nord8 (if (display-graphic-p) "#88C0D0" "brightcyan"))
      (nord9 (if (display-graphic-p) "#81A1C1" "blue"))
      (nord10 (if (display-graphic-p) "#5E81AC" "brightblue"))
      (nord11 (if (display-graphic-p) "#BF616A" "red"))
      (nord12 (if (display-graphic-p) "#D08770" "brightyellow"))
      (nord13 (if (display-graphic-p) "#EBCB8B" "yellow"))
      (nord14 (if (display-graphic-p) "#A3BE8C" "green"))
      (nord15 (if (display-graphic-p) "#B48EAD" "magenta")))
  (custom-theme-set-faces 'user
                          `(org-block ((,class (:foreground ,nord4 :background ,nord1))))
                          `(org-block-begin-line ((,class (:foreground ,nord9 :background ,nord2))))
                          `(org-block-end-line ((,class (:foreground ,nord9 :background ,nord2))))
                          `(org-checkbox ((,class (:foreground ,nord9 :background ,nord2))))))
#+END_SRC

#+RESULTS:

* COMMENT =DOOM-THEMES=
#+BEGIN_SRC emacs-lisp
;;(require 'doom-themes)
(use-package doom-themes
  :ensure t)
;; Global settings (defaults)
(setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
      doom-themes-enable-italic t) ; if nil, italics is universally disabled

;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
;; may have their own settings.
(load-theme 'doom-one t)

;; Enable flashing mode-line on errors
(doom-themes-visual-bell-config)

;; Enable custom neotree theme (all-the-icons must be installed!)
(doom-themes-neotree-config)
;; or for treemacs users
(doom-themes-treemacs-config)

;; Corrects (and improves) org-mode's native fontification.
(doom-themes-org-config)
#+END_SRC

#+RESULTS:
: doom-themes-org

* COMMENT Theme toggle
#+BEGIN_SRC emacs-lisp
  (setq custom-safe-themes t) ;; stop asking if custom themes are safe
  (load-theme 'doom-one t)

  ;; Source of this theme toggle (adaptations by me):
  ;; https://emacs.stackexchange.com/questions/24088/make-a-function-to-toggle-themes
  (defvar doom-one-theme 'doom-one)
  (defvar doom-one-light-theme 'doom-one-light)
  (defvar tk-theme-current doom-one-theme)

  ;; disable other themes before loading new one
  (defadvice contrib/load-theme (before theme-dont-propagate activate)
    "Disable theme before loading new one."
    (mapcar #'disable-theme custom-enabled-themes))

  (defun contrib/next-theme (theme)
    (if (eq theme 'default)
	(disable-theme 'default)
      (progn
	(load-theme theme t)))
    (setq tk-theme-current theme))

  (defun contrib/toggle-theme ()
    (interactive)
    (cond ((eq tk-theme-current doom-one-theme) (contrib/next-theme doom-one-light-theme))
	  ((eq tk-theme-current doom-one-light-theme) (contrib/next-theme doom-one-theme))))
  (global-set-key (kbd "C-c M-t") 'contrib/toggle-theme)
#+END_SRC

#+RESULTS:
: contrib/toggle-theme

* =TREEMACS=
#+BEGIN_SRC emacs-lisp
(use-package treemacs
  :ensure t
  :defer t
  :init
  (with-eval-after-load 'winum
    (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
  :config
  (progn
    (setq treemacs-collapse-dirs                 (if (executable-find "python3") 3 0)
          treemacs-deferred-git-apply-delay      0.5
          treemacs-display-in-side-window        t
          treemacs-eldoc-display                 t
          treemacs-file-event-delay              5000
          treemacs-file-follow-delay             0.2
          treemacs-follow-after-init             t
          treemacs-git-command-pipe              ""
          treemacs-goto-tag-strategy             'refetch-index
          treemacs-indentation                   2
          treemacs-indentation-string            " "
          treemacs-is-never-other-window         nil
          treemacs-max-git-entries               5000
          treemacs-missing-project-action        'ask
          treemacs-no-png-images                 nil
          treemacs-no-delete-other-windows       t
          treemacs-project-follow-cleanup        nil
          treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
          treemacs-recenter-distance             0.1
          treemacs-recenter-after-file-follow    nil
          treemacs-recenter-after-tag-follow     nil
          treemacs-recenter-after-project-jump   'always
          treemacs-recenter-after-project-expand 'on-distance
          treemacs-show-cursor                   nil
          treemacs-show-hidden-files             t
          treemacs-silent-filewatch              nil
          treemacs-silent-refresh                nil
          treemacs-sorting                       'alphabetic-desc
          treemacs-space-between-root-nodes      t
          treemacs-tag-follow-cleanup            t
          treemacs-tag-follow-delay              1.5
          treemacs-width                         35)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
    (pcase (cons (not (null (executable-find "git")))
                 (not (null (executable-find "python3"))))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple))))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))

(use-package treemacs-evil
  :after treemacs evil
  :ensure t)

(use-package treemacs-projectile
  :after treemacs projectile
  :ensure t)

(use-package treemacs-icons-dired
  :after treemacs dired
  :ensure t
  :config (treemacs-icons-dired-mode))

(use-package treemacs-magit
  :after treemacs magit
  :ensure t)
#+END_SRC

#+RESULTS:
* Sensible Defaults
To use Harry Schwartz's sensible defaults,
#+BEGIN_SRC emacs-lisp
(load-file "~/.emacs.d/sensible-defaults.el")
#+END_SRC

#+BEGIN_EXAMPLE
(defun sensible-defaults/use-all-settings ()
  "Use all of the sensible-defaults settings."
  (sensible-defaults/open-files-from-home-directory)
  (sensible-defaults/increase-gc-threshold)
  (sensible-defaults/delete-trailing-whitespace)
  (sensible-defaults/treat-camelcase-as-separate-words)
  (sensible-defaults/automatically-follow-symlinks)
  (sensible-defaults/make-scripts-executable)
  (sensible-defaults/single-space-after-periods)
  (sensible-defaults/offer-to-create-parent-directories-on-save)
  (sensible-defaults/apply-changes-to-highlighted-region)
  (sensible-defaults/overwrite-selected-text)
  (sensible-defaults/ensure-that-files-end-with-newline)
  (sensible-defaults/confirm-closing-emacs)
  (sensible-defaults/quiet-startup)
  (sensible-defaults/make-dired-file-sizes-human-readable)
  (sensible-defaults/shorten-yes-or-no)
  (sensible-defaults/always-highlight-code)
  (sensible-defaults/refresh-buffers-when-files-change)
  (sensible-defaults/show-matching-parens)
  (sensible-defaults/flash-screen-instead-of-ringing-bell)
  (sensible-defaults/set-default-line-length-to 80)
  (sensible-defaults/open-clicked-files-in-same-frame-on-mac)
  (sensible-defaults/yank-to-point-on-mouse-click))
#+END_EXAMPLE

* Interface Tweaks
** Basics
 #+BEGIN_SRC emacs-lisp
   (setq inhibit-startup-message t)
   (setq frame-title-format "TaEmaX")
   (scroll-bar-mode -1)
   (setq initial-buffer-choice t)
   (setq initial-scratch-message "")
 #+END_SRC

