emacs/taemax/config.org
** From =prelude-ui.el=
#+BEGIN_SRC emacs-lisp
(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))

(menu-bar-mode -1)

;; the blinking cursor is nothing, but an annoyance
(blink-cursor-mode -1)

;; disable the annoying bell ring
(setq ring-bell-function 'ignore)

;; disable startup screen
(setq inhibit-startup-screen t)

;; nice scrolling
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

;; mode line settings
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

;; enable y/n answers
(fset 'yes-or-no-p 'y-or-n-p)

;; more useful frame title, that show either a file or a
;; buffer name (if the buffer isn't visiting a file)
(setq frame-title-format
      '("" invocation-name " Prelude - " (:eval (if (buffer-file-name)
                                                    (abbreviate-file-name (buffer-file-name))
                                                  "%b"))))

;; show the cursor when moving after big movements in the window
(use-package beacon
  :ensure t)
(beacon-mode +1)

;; show available keybindings after you start typing
(use-package which-key
  :ensure t)
(which-key-mode +1)
#+END_SRC

* Managing Windows and Buffers
** Resizing Windows
 #+BEGIN_SRC emacs-lisp
   (bind-key "s-C-<left>"  'shrink-window-horizontally)
   (bind-key "s-C-<right>" 'enlarge-window-horizontally)
   (bind-key "s-C-<down>"  'shrink-window)
   (bind-key "s-C-<up>"    'enlarge-window)
 #+END_SRC
** Split and Switch
Whenever I split windows, I usually do so and also switch to the other
window as well, so might as well rebind the splitting key bindings to
do just that to reduce the repetition.
 #+BEGIN_SRC emacs-lisp
   (defun vsplit-other-window ()
     "Splits the window vertically and switches to that window."
     (interactive)
     (split-window-vertically)
     (other-window 1 nil))
   (defun hsplit-other-window ()
     "Splits the window horizontally and switches to that window."
     (interactive)
     (split-window-horizontally)
     (other-window 1 nil))
   (bind-key "C-x 2" 'vsplit-other-window)
   (bind-key "C-x 3" 'hsplit-other-window)
 #+END_SRC
** =SWITCH-WINDOW=
#+BEGIN_SRC emacs-lisp
(use-package switch-window
  :ensure t)
(bind-key "C-z" 'switch-window)
#+END_SRC

** =BUFFER-MOVE=
#+BEGIN_SRC emacs-lisp
  (use-package buffer-move
    :ensure t)
  (global-set-key (kbd "H-S-k") 'buf-move-up)
  (global-set-key (kbd "H-S-j") 'buf-move-down)
  (global-set-key (kbd "H-S-h") 'buf-move-left)
  (global-set-key (kbd "H-S-l") 'buf-move-right)
#+END_SRC

#+RESULTS:
: buf-move-right
* Handling Backup Files
#+BEGIN_SRC emacs-lisp
;; store all backup and autosave files in the tmp dir
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
#+END_SRC

#+RESULTS:
* Configuration File Edit and Reload
** Editing
#+BEGIN_SRC emacs-lisp
  (defun visit-config()
    (interactive)
    (find-file "~/.emacs.d/config.org"))
#+END_SRC

#+RESULTS:
: visit-config

** Reload
#+BEGIN_SRC emacs-lisp
  (defun reload-config()
    (interactive)
    (org-babel-load-file (expand-file-name "~/.emacs.d/config.org")))
#+END_SRC

#+RESULTS:
: reload-config
* Transparency
#+BEGIN_SRC emacs-lisp
  ;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
  ;;(set-frame-parameter (selected-frame) 'alpha <both>)
  (set-frame-parameter (selected-frame) 'alpha '(90 . 80))
  (add-to-list 'default-frame-alist '(alpha . (90 . 80)))
#+END_SRC

#+RESULTS:
: ((alpha 90 . 80) (alpha 90 . 50) (vertical-scroll-bars))

#+BEGIN_SRC emacs-lisp
  (defun toggle-transparency ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (set-frame-parameter
       nil 'alpha
       (if (eql (cond ((numberp alpha) alpha)
                      ((numberp (cdr alpha)) (cdr alpha))
                      ;; Also handle undocumented (<active> <inactive>) form.
                      ((numberp (cadr alpha)) (cadr alpha)))
                100)
           '(90 . 50) '(100 . 100)))))
  (global-set-key (kbd "C-M-S-t") 'toggle-transparency)
#+END_SRC

#+RESULTS:
: toggle-transparency

#+begin_src emacs-lisp
  (defun transparency (value)
    "Sets the transparency of the frame window. 0=transparent/100=opaque."
    (interactive "nTransparency Value 0 - 100 opaque:")
    (set-frame-parameter (selected-frame) 'alpha value))
#+end_src

#+RESULTS:
: transparency
* =HELM=
#+BEGIN_SRC emacs-lisp
  (use-package helm
    :ensure t)
  (helm-mode 1)
  (helm-autoresize-mode 1)
  (setq helm-split-window-in-side-p
        t)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (global-set-key (kbd "C-x C-m") 'helm-M-x)
  (global-set-key (kbd "M-y") 'helm-show-kill-ring)
  (global-set-key (kbd "C-x b") 'helm-mini)
  (global-set-key (kbd "C-x C-b") 'helm-buffers-list)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (global-set-key (kbd "C-h f") 'helm-apropos)
  (global-set-key (kbd "C-h r") 'helm-info-emacs)
  (global-set-key (kbd "C-h C-l") 'helm-locate-library)
#+END_SRC

#+RESULTS:
: helm-locate-library

* Exec-path
To have shell environments transferred to emacs. Install =exec-path-from-shell= with =M-x package-install-packages= (or use =use-package=) and then
#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :ensure t)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+END_SRC

#+RESULTS:
: ((MANPATH) (PATH . /usr/local/anaconda/bin:/home/tae/bin:/usr/local/bin:/usr/local/bin:/usr/bin:/bin:/usr/local/sbin:/usr/bin/site_perl:/usr/bin/vendor_perl:/usr/bin/core_perl:/home/tae/.scripts/tools:/home/tae/.scripts/i3cmds:/home/tae/.scripts/tkconf:/home/tae/.scripts/:/usr/bin/site_perl:/usr/bin/vendor_perl:/usr/bin/core_perl:/home/tae/.scripts/tools:/home/tae/.scripts/i3cmds:/home/tae/.scripts/tkconf:/home/tae/.scripts/))

* Org Mode
** Org bullets makes things look nice
*** Original org-bullets-bullet-list:
("◉" "○" "✸" "✿")
*** Candidate symbol lists:
Source: [[https://zhangda.wordpress.com/2016/02/15/configurations-for-beautifying-emacs-org-mode/][Da's web notes]]
 - hexagrams
   “✡” “⎈” “✽” “✲” “✱” “✻” “✼” “✽” “✾” “✿” “❀” “❁” “❂” “❃” “❄” “❅” “❆” “❇”

 - circles
   “○” “☉” “◎” “◉” “○” “◌” “◎” “●” “◦” “◯” “⚪” “⚫” “⚬” “❍” “￮” “⊙” “⊚” “⊛” “∙” “∘”

 - special circles
   “◐” “◑” “◒” “◓” “◴” “◵” “◶” “◷” “⚆” “⚇” “⚈” “⚉” “♁” “⊖” “⊗” “⊘”

 - crosses
   “✙” “♱” “♰” “☥” “✞” “✟” “✝” “†” “✠” “✚” “✜” “✛” “✢” “✣” “✤” “✥”

 - poker sybmols
   “♠” “♣” “♥” “♦” “♤” “♧” “♡” “♢”

 - yinyang
   “☯” “☰” “☱” “☲” “☳” “☴” “☵” “☶” “☷”

 - special symbols
   “☀” “♼” “☼” “☾” “☽” “☣” “§” “¶” “‡” “※” “✕” “△” “◇” “▶” “◀” “◈”

*** My Choice
 #+BEGIN_SRC emacs-lisp
   (use-package org-bullets
     :ensure t
     :config
     (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
   (setq org-bullets-bullet-list '("⊚" "⊙" "◉" "○" "●" "⚬" "◦"))
   ;; (setq org-bullets-bullet-list '("◉" "○" "✸" "✿"))

 #+END_SRC

 #+RESULTS:
 | ⊚ | ⊙ | ◉ | ○ | ● | ⚬ | ◦ |

** Org-ellipsis

*Some options*
 - right arrows
   “↝” “⇉” “⇝” “⇢” “⇨” “⇰” “➔” “➙” “➛” “➜” “➝” “➞”
   “➟” “➠” “➡” “➥” “➦” “➧” “➨”
   “➩” “➪” “➮” “➯” “➱” “➲”
   “➳” “➵” “➸” “➺” “➻” “➼” “➽”

 - arrow heads
   “➢” “➣” “➤” “≪”, “≫”, “«”, “»”

 - other arrows
   “↞” “↠” “↟” “↡” “↺” “↻”

 - lightening
   “⚡”

 - other symbols
   "…", "▼", "↴", "∞", "⬎", "⤷", "⤵"

#+BEGIN_SRC emacs-lisp
  (setq org-ellipsis " ↴")
#+END_SRC

#+RESULTS:
:  ↴
** More org-mode cosmetics
*** Better List Bullet
 - *Reference*: https://zzamboni.org/post/beautifying-org-mode-in-emacs/
 #+BEGIN_SRC emacs-lisp
;; Org-mode configuration
(font-lock-add-keywords
 'org-mode
 '(("^ +\\([-*]\\) "
    (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
 #+END_SRC

 #+RESULTS:

*** Org headlines
 #+BEGIN_SRC emacs-lisp
(let* ((variable-tuple (cond ((x-list-fonts "Inconsolata") '(:font "Inconsolata"))
                             ((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
                             ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
                             ((x-list-fonts "Verdana")         '(:font "Verdana"))
                             ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
                             (nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
       (base-font-color     (face-foreground 'default nil 'default))
       (headline           `(:inherit default :weight bold :foreground ,base-font-color)))
  (custom-theme-set-faces 'user
                          `(org-level-8 ((t (,@headline ,@variable-tuple))))
                          `(org-level-7 ((t (,@headline ,@variable-tuple))))
                          `(org-level-6 ((t (,@headline ,@variable-tuple))))
                          `(org-level-5 ((t (,@headline ,@variable-tuple))))
                          `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.05))))
                          `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.15))))
                          `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.25))))
                          `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.5))))
                          `(org-document-title ((t (,@headline ,@variable-tuple :height 1.5 :underline nil))))))
 #+END_SRC
