emacs/taemax/config.org
*** Org TODO Keywords
 #+BEGIN_SRC emacs-lisp
;; Fancy todo list
;; (setq org-todo-keywords
;;       '((sequence "☛ TODO(t)" "|" "✔ DONE(d)")
;;         (sequence "☞ WAITING(w)" "|")
;;         (sequence "|" "✘ CANCELED(c)")))

;; below comes from https://github.com/rickardsundin/dotfiles/blob/master/emacs.org and https://github.com/howardabrams/dot-files/blob/master/emacs-org.org
(setq org-todo-keywords
      '((sequence "TODO(t)" "DOING(i)" "WAITING(w)" "|" "DONE(d)" "|" "CANCELED(c)")))

;; (font-lock-add-keywords            ; A bit silly but my headers are now
;;  'org-mode `(("^\\*+ \\(TODO\\) "  ; shorter, and that is nice canceled
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚑")
;;                         nil)))
;;              ("^\\*+ \\(DOING\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚐")
;;                         nil)))
;;              ("^\\*+ \\(WAITING\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⌛")
;;                         nil)))
;;              ("^\\*+ \\(CANCELED\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "✘")
;;                         nil)))
;;              ("^\\*+ \\(DONE\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "✔")
;;                         nil)))))
 #+END_SRC

 #+RESULTS:
 | sequence | TODO(t) | DOING(i) | WAITING(w) |   |   | DONE(d) |   |   | CANCELED(c) |

** Hide markups
#+BEGIN_SRC emacs-lisp
;; Remove the markup characters, i.e., "/text/" becomes (italized) "text"
(setq org-hide-emphasis-markers nil)
;; (setq org-hide-emphasis-markers t)
#+END_SRC

#+RESULTS:

*Bold* /italic/ _underline_ +strike-through+ ~code~ =verbatim=

** More org stuff
 #+BEGIN_SRC emacs-lisp
   (setq org-confirm-babel-evaluate nil)
   (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
   (add-hook 'org-mode-hook 'org-display-inline-images)
 #+END_SRC

** Babel editing in the current window
Possible set-ups:
 - =current-window=
 - =other-window=
 - =reorganize-frame=
 - =other-frame=
#+BEGIN_SRC emacs-lisp
(setq org-src-window-setup 'reorganize-frame)
#+END_SRC

#+RESULTS:
: reorganize-frame

** Org Babel
*** COMMENT =org-structure- template-alist=: changed in org 9.2
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("sh" "#+BEGIN_SRC sh\n?\n#+END_SRC"))
#+END_SRC

#+RESULTS:
| sh | #+BEGIN_SRC sh |

*** Babel languages
 #+BEGIN_SRC emacs-lisp
   (org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
      ;; (ruby . t)
      (lisp . t)
      (matlab . t)
      (fortran . t)
      (python . t)
      ;; (ipython . t)
      (shell . t)
      (C . t)
      (makefile . t)
      ;; (mathematica . t)
      ;; (maple . t)
      (dot . t)
      (octave . t)
      ))
 #+END_SRC

 #+RESULTS:
*** Org source language
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-src-lang-modes '("fortran" . f90))
#+END_SRC

#+RESULTS:
: ((fortran . f90) (ocaml . tuareg) (elisp . emacs-lisp) (ditaa . artist) (asymptote . asy) (dot . fundamental) (sqlite . sql) (calc . fundamental) (C . c) (cpp . c++) (C++ . c++) (screen . shell-script) (shell . sh) (bash . sh))

** =org-src-preserve-indentation=
#+BEGIN_SRC emacs-lisp
(setq org-src-preserve-indentation t)
#+END_SRC

#+RESULTS:
: t

* TeX Editing Environment
** Basic: Required Packages and Files
#+BEGIN_SRC emacs-lisp
(use-package auctex
  :ensure t)

(use-package cdlatex
  :ensure t)

(use-package smartparens
  :ensure t)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
(require 'smartparens-latex)
(require 'cl)
#+END_SRC

#+RESULTS:
: cl

** Basic Configuration
#+BEGIN_SRC emacs-lisp
;; AUCTeX configuration
(setq TeX-auto-save t)
(setq TeX-parse-self t)
;; (setq TeX-close-quote "")
;; (setq TeX-open-quote "")
(setq TeX-close-quote "''")
(setq TeX-open-quote "``")

;; For multi-file document structures (e.g. \include or \input)
(setq-default TeX-master nil)

;; use pdflatex
(setq TeX-PDF-mode t)
#+END_SRC

** Default LaTeX-mode-hook (from prelude)
#+BEGIN_SRC emacs-lisp
(defcustom prelude-latex-fast-math-entry 'LaTeX-math-mode
  "Method used for fast math symbol entry in LaTeX."
  :link '(function-link :tag "AUCTeX Math Mode" LaTeX-math-mode)
  :link '(emacs-commentary-link :tag "CDLaTeX" "cdlatex.el")
  :group 'prelude
  :type '(choice (const :tag "None" nil)
                 (const :tag "AUCTeX Math Mode" LaTeX-math-mode)
                 (const :tag "CDLaTeX" cdlatex)))

(defun prelude-latex-mode-defaults ()
  "Default Prelude hook for `LaTeX-mode'."
  (turn-on-reftex)
  (abbrev-mode +1)
  (smartparens-mode +1)
  (visual-line-mode +1)
  (flyspell-mode +1)
  (case prelude-latex-fast-math-entry
    (LaTeX-math-mode (LaTeX-math-mode 1))
    (cdlatex (turn-on-cdlatex))))

(setq reftex-plug-into-AUCTeX t)

(setq prelude-latex-mode-hook 'prelude-latex-mode-defaults)

(add-hook 'LaTeX-mode-hook (lambda ()
			     (run-hooks 'prelude-latex-mode-hook)))
#+END_SRC

** More hooks
 #+BEGIN_SRC emacs-lisp
;; More hooks
(setq TeX-source-correlate-mode t)
(setq TeX-source-correlate-start-server t)
(setq TeX-source-correlate-method 'synctex)
(remove-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
(add-hook 'LaTeX-mode-hook 'TeX-PDF-mode)
(add-hook 'LaTeX-mode-hook 'TeX-source-correlate-mode)
 #+END_SRC

 #+RESULTS:
 | TeX-source-correlate-mode | TeX-PDF-mode | (lambda nil (setq TeX-command-list (cons (quote (latexmk latexmk -pdf %s TeX-run-TeX nil t :help Run latexmk on file)) TeX-command-list))) | (lambda nil (run-hooks (quote prelude-latex-mode-hook))) |

** latexmk
#+BEGIN_SRC emacs-lisp
(add-hook 'LaTeX-mode-hook (lambda ()
			     (push
			      '("latexmk" "latexmk -pdf %s" TeX-run-TeX nil t
				:help "Run latexmk on file")
			      TeX-command-list)))
(add-hook 'TeX-mode-hook '(lambda () (setq TeX-command-default "latexmk")))
#+END_SRC

#+RESULTS:
| lambda | nil | (setq TeX-command-default latexmk) |

** AucTeX and Zathura
#+BEGIN_SRC emacs-lisp
;;(TeX-source-correlate-mode)        ; activate forward/reverse search
;;(TeX-PDF-mode)
;(add-to-list 'TeX-view-program-list '("zathura" zathura-forward-search))
(setq TeX-view-program-list '("zathura" zathura-forward-search))
(setq TeX-view-program-selection (quote ((output-pdf "zathura") (output-dvi "xdvi"))))

(setq zathura-procs ())
(defun zathura-forward-search ()
  ;; Open the compiled pdf in Zathura with synctex. This is complicated since
  ;; 1) Zathura refuses to acknowledge Synctex directive if the pdf is not
  ;; already opened
  ;; 2) This means we have to bookkeep open Zathura processes ourselves: first
  ;; open a new pdf from the beginning, if it is not already open. Then call
  ;; Zathura again with the synctex directive.
  (interactive)
  (let* ((zathura-launch-buf (get-buffer-create "*Zathura Output*"))
         (pdfname (TeX-master-file "pdf"))
         (zatentry (assoc pdfname zathura-procs))
         (zatproc (if (and zatentry (process-live-p (cdr zatentry)))
                      (cdr zatentry)
                    (progn
                      (let ((proc (progn (message "Launching Zathura")
                                         (start-process "zathura-launch"
                                                        zathura-launch-buf "zathura"
                                                        "-x" "emacsclient +%{line} %{input}" pdfname))))
                        (when zatentry
                          (setq zathura-procs (delq zatentry zathura-procs)))
                        (add-to-list 'zathura-procs (cons pdfname proc))
                        (set-process-query-on-exit-flag proc nil)
                        proc))))
         (pid (process-id zatproc))
         (synctex (format "%s:0:%s"
                          (TeX-current-line)
                          (TeX-current-file-name-master-relative)))
         )
    (start-process "zathura-synctex" zathura-launch-buf "zathura" "--synctex-forward" synctex pdfname)
    (start-process "raise-zathura-wmctrl" zathura-launch-buf "wmctrl" "-a" pdfname)
    ))
#+END_SRC

#+RESULTS:
: zathura-forward-search

* Emacsclient
 #+BEGIN_SRC emacs-lisp
   (use-package server
    :config
    (server-start))
 #+END_SRC

 #+RESULTS:
 : t
