emacs/taemax/config.el
;; (setq org-todo-keywords
;;       '((sequence "☛ TODO(t)" "|" "✔ DONE(d)")
;;         (sequence "☞ WAITING(w)" "|")
;;         (sequence "|" "✘ CANCELED(c)")))

;; below comes from https://github.com/rickardsundin/dotfiles/blob/master/emacs.org and https://github.com/howardabrams/dot-files/blob/master/emacs-org.org
(setq org-todo-keywords
      '((sequence "TODO(t)" "DOING(i)" "WAITING(w)" "|" "DONE(d)" "|" "CANCELED(c)")))

;; (font-lock-add-keywords            ; A bit silly but my headers are now
;;  'org-mode `(("^\\*+ \\(TODO\\) "  ; shorter, and that is nice canceled
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚑")
;;                         nil)))
;;              ("^\\*+ \\(DOING\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⚐")
;;                         nil)))
;;              ("^\\*+ \\(WAITING\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "⌛")
;;                         nil)))
;;              ("^\\*+ \\(CANCELED\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "✘")
;;                         nil)))
;;              ("^\\*+ \\(DONE\\) "
;;               (1 (progn (compose-region (match-beginning 1) (match-end 1) "✔")
;;                         nil)))))

;; Remove the markup characters, i.e., "/text/" becomes (italized) "text"
(setq org-hide-emphasis-markers nil)
;; (setq org-hide-emphasis-markers t)

(setq org-confirm-babel-evaluate nil)
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(add-hook 'org-mode-hook 'org-display-inline-images)

(setq org-src-window-setup 'reorganize-frame)

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
(add-to-list 'org-structure-template-alist
             '("sh" "#+BEGIN_SRC sh\n?\n#+END_SRC"))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   ;; (ruby . t)
   (lisp . t)
   (matlab . t)
   (fortran . t)
   (python . t)
   ;; (ipython . t)
   (shell . t)
   (C . t)
   (makefile . t)
   ;; (mathematica . t)
   ;; (maple . t)
   (dot . t)
   (octave . t)
   ))

(add-to-list 'org-src-lang-modes '("fortran" . f90))

(setq org-src-preserve-indentation t)

(use-package auctex
  :ensure t)

(use-package cdlatex
  :ensure t)

(use-package smartparens
  :ensure t)

(require 'smartparens-latex)
(require 'cl)

;; AUCTeX configuration
(setq TeX-auto-save t)
(setq TeX-parse-self t)
;; (setq TeX-close-quote "")
;; (setq TeX-open-quote "")
(setq TeX-close-quote "''")
(setq TeX-open-quote "``")

;; For multi-file document structures (e.g. \include or \input)
(setq-default TeX-master nil)

;; use pdflatex
(setq TeX-PDF-mode t)

(defcustom prelude-latex-fast-math-entry 'LaTeX-math-mode
  "Method used for fast math symbol entry in LaTeX."
  :link '(function-link :tag "AUCTeX Math Mode" LaTeX-math-mode)
  :link '(emacs-commentary-link :tag "CDLaTeX" "cdlatex.el")
  :group 'prelude
  :type '(choice (const :tag "None" nil)
                 (const :tag "AUCTeX Math Mode" LaTeX-math-mode)
                 (const :tag "CDLaTeX" cdlatex)))

(defun prelude-latex-mode-defaults ()
  "Default Prelude hook for `LaTeX-mode'."
  (turn-on-reftex)
  (abbrev-mode +1)
  (smartparens-mode +1)
  (visual-line-mode +1)
  (flyspell-mode +1)
  (case prelude-latex-fast-math-entry
    (LaTeX-math-mode (LaTeX-math-mode 1))
    (cdlatex (turn-on-cdlatex))))
  
(setq reftex-plug-into-AUCTeX t)

(setq prelude-latex-mode-hook 'prelude-latex-mode-defaults)

(add-hook 'LaTeX-mode-hook (lambda ()
			     (run-hooks 'prelude-latex-mode-hook)))

(add-hook 'LaTeX-mode-hook (lambda ()
			     (push
			      '("latexmk" "latexmk -pdf %s" TeX-run-TeX nil t
				:help "Run latexmk on file")
			      TeX-command-list)))
(add-hook 'TeX-mode-hook '(lambda () (setq TeX-command-default "latexmk")))
